## Importing  required libraries

In [82]:
import pandas as pd
import mysql.connector as sql

## Pandas DB connectivity with MySQL

### Installing MySQL

* **MySQL**  is an open-source relational database management system. 
* Read more about it from : https://www.mysql.com/




* Installing MySQL on **macOS** :
    * https://dev.mysql.com/doc/refman/5.7/en/macos-installation-pkg.html
* Installing MySQL on **Windows** :
    * https://dev.mysql.com/downloads/installer/

### MySQL Workbench

* **MySQL**  Workbench is a unified visual tool for database architects, developers, and DBAs. MySQL Workbench provides data modeling, SQL development, and comprehensive administration tools for server configuration, user administration, backup, and much more. MySQL Workbench is available on Windows, Linux and Mac OS X. 

* Read more about it from : https://www.mysql.com/products/workbench/
* Installing MySQL Workbench :
    * https://dev.mysql.com/downloads/workbench/

#### MySQL DB Credentials

In [83]:
db='data_science'
user='root'
paswd='D@tascience'
host='localhost'

## Establishing a MySQL database connection

In [84]:
try:
    conn = sql.connect(db=db, user=user, host=host, 
                       password=paswd, use_unicode=True, charset="utf8")
    
except Error as e:
    print('Could not establish connection : ', e)

In [85]:
db_cursor = conn.cursor()

* **columns=db_cursor.column_names** is used to display the **column names in dataframe header else it will display 0, 1,2 etc..**

In [86]:
try:
    db_cursor.execute('SELECT * FROM customers')
    table_rows = db_cursor.fetchall()
    cust_df = pd.DataFrame(table_rows, columns=db_cursor.column_names)

except (sql.Error, sql.Warning) as e:
    print('Error while fetching recoeds from customers : ', e)

In [87]:
db_cursor.close()
conn.close()

In [88]:
print('cust_df.shape : ', cust_df.shape)
cust_df

cust_df.shape :  (122, 13)

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",None,Nantes,None,44000,France,1370.0,21000.00
1,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,None,Las Vegas,NV,83030,USA,1166.0,71800.00
2,114,"Australian Collectors, Co.",Ferguson,Peter,03 9520 4555,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,1611.0,117300.00
3,119,La Rochelle Gifts,Labrune,Janine,40.67.8555,"67, rue des Cinquante Otages",None,Nantes,None,44000,France,1370.0,118200.00
4,121,Baane Mini Imports,Bergulfsen,Jonas,07-98 9555,Erling Skakkes gate 78,None,Stavern,None,4110,Norway,1504.0,81700.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...
117,486,Motor Mint Distributors Inc.,Salazar,Rosa,2155559857,11328 Douglas Av.,None,Philadelphia,PA,71270,USA,1323.0,72600.00
118,487,Signal Collectibles Ltd.,Taylor,Sue,4155554312,2793 Furth Circle,None,Brisbane,CA,94217,USA,1165.0,60300.00
119,489,"Double Decker Gift Stores, Ltd",Smith,Thomas,(171) 555-7555,120 Hanover Sq.,None,London,None,WA1 1DP,UK,1501.0,43300.00
120,495,Diecast Collectables,Franco,Valarie,6175552555,6251 Ingle Ln.,None,Boston,MA,51003,USA,1188.0,85100.00
121,496,Kelly's Gift Shop,Snowden,Tony,+64 9 5555500,Arenales 1938 3'A',None,Auckland,None,None,New Zealand,1612.0,110000.00

In [89]:
cust_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   customerNumber          122 non-null    int64
 1   customerName            122 non-null    object
 2   contactLastName         122 non-null    object
 3   contactFirstName        122 non-null    object
 4   phone                   122 non-null    object
 5   addressLine1            122 non-null    object
 6   addressLine2            22 non-null     object
 7   city                    122 non-null    object
 8   state                   49 non-null     object
 9   postalCode              115 non-null    object
 10  country                 122 non-null    object
 11  salesRepEmployeeNumber  100 non-null    float64
 12  creditLimit             122 non-null    object
dtypes: float64(1), int64(1), object(11)
memory usage: 12.5+ KB

In [90]:
cust_df.describe()

       customerNumber  salesRepEmployeeNumber
count      122.000000               100.00000
mean       296.401639              1395.94000
std        117.077544               165.67193
min        103.000000              1165.00000
25%        191.250000              1286.00000
50%        298.500000              1370.00000
75%        384.250000              1504.00000
max        496.000000              1702.00000

## Pandas DB connectivity with Oracle

### Using cx_Oracle
* https://oracle.github.io/python-cx_Oracle/samples/tutorial/Python-and-Oracle-Database-Scripting-for-the-Future.html
* https://www.geeksforgeeks.org/oracle-database-connection-in-python/

In [91]:
import cx_Oracle